In [1]:
import numpy as np
import pandas as pd

### Concatenation

In [9]:
data1 = {'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']}

In [10]:
data1 = pd.DataFrame(data1)

In [11]:
data1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [12]:
data2 = pd.DataFrame({'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [13]:
data2

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

### Concatenate along rows (axis = 0)

In [17]:
row = pd.concat([data1,data2],axis=0)
row

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

### Concatenate along columns (axis = 1)

In [18]:
colm = pd.concat([data1,data2],axis=1)
colm

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [21]:
data1.columns = data2.columns

In [22]:
data1

    C   D
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [23]:
data2

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [26]:
colm1 = pd.concat([data1,data2])
colm1

    C   D
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

### Merge

In [46]:
registrations=pd.DataFrame({'st_id':[1,2,3,4],'st_name':['A','B','C','D']})
logins=pd.DataFrame({'st_id':[1,2,3,4],'st_name':['X','A','Y','B']})

In [29]:
registrations

   st_id st_name
0      1       A
1      2       B
2      3       C
3      4       D

In [30]:
logins

   st_id st_name
0      1       X
1      2       A
2      3       Y
3      4       B

Merging is based on SQL: Structured Query Language

#### Inner Join and Outer Join

In [34]:
pd.merge(registrations,logins,on='st_name',how='inner')

   st_id_x st_name  st_id_y
0        1       A        2
1        2       B        4

In [35]:
pd.merge(registrations,logins,on='st_name',how='outer')

   st_id_x st_name  st_id_y
0      1.0       A      2.0
1      2.0       B      4.0
2      3.0       C      NaN
3      4.0       D      NaN
4      NaN       X      1.0
5      NaN       Y      3.0

### Left and Right Join

In [38]:
registrations

   st_id st_name
0      1       A
1      2       B
2      3       C
3      4       D

In [39]:
logins

   st_id st_name
0      1       X
1      2       A
2      3       Y
3      4       B

In [36]:
pd.merge(registrations,logins,on='st_name',how='left')

   st_id_x st_name  st_id_y
0        1       A      2.0
1        2       B      4.0
2        3       C      NaN
3        4       D      NaN

In [37]:
pd.merge(registrations,logins,on='st_name',how='right')

   st_id_x st_name  st_id_y
0      NaN       X        1
1      1.0       A        2
2      NaN       Y        3
3      2.0       B        4

### Join on Index

In [48]:
registrations.set_index('st_name',inplace = True)

In [49]:
registrations

         st_id
st_name
A            1
B            2
C            3
D            4

In [47]:
logins

   st_id st_name
0      1       X
1      2       A
2      3       Y
3      4       B

In [51]:
pd.merge(registrations,logins,left_index=True, right_on='st_name')

   st_id_x  st_id_y st_name
1        1        2       A
3        2        4       B

In [54]:
pd.merge(logins,registrations,right_index=True, left_on='st_name')

   st_id_x st_name  st_id_y
1        2       A        1
3        4       B        2

In [55]:
registrations.reset_index(inplace=True)

In [56]:
registrations

  st_name  st_id
0       A      1
1       B      2
2       C      3
3       D      4

In [57]:
logins

   st_id st_name
0      1       X
1      2       A
2      3       Y
3      4       B

In [59]:
registrations.columns = ['reg_name','reg_id']

In [60]:
registrations

  reg_name  reg_id
0        A       1
1        B       2
2        C       3
3        D       4

In [61]:
pd.merge(registrations,logins)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [62]:
pd.merge(registrations,logins,left_on='reg_name',right_on='st_name')

  reg_name  reg_id  st_id st_name
0        A       1      2       A
1        B       2      4       B

In [64]:
pd.merge(registrations,logins,left_on='reg_name',right_on='st_name').drop('reg_name', axis=1)

   reg_id  st_id st_name
0       1      2       A
1       2      4       B